modules/integration/tests-integration/src/test/resources/windows/enrollment/discovery-post.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Header>
        <a:Action s:mustUnderstand="1">http://schemas.microsoft.com/windows/management/2012/01/enrollment/IDiscoveryService/Discover</a:Action>
        <a:MessageID>urn:uuid:748132ec-a575-4329-b01b-6171a9cf8478</a:MessageID>
        <a:ReplyTo>
            <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
        </a:ReplyTo>
        <a:To s:mustUnderstand="1">https://EnterpriseEnrollment.wso2.com:443/EnrollmentServer/Discovery.svc</a:To>
    </s:Header>
    <s:Body>
        <Discover xmlns="http://schemas.microsoft.com/windows/management/2012/01/enrollment">
            <request xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <EmailAddress>admin@wso2.com</EmailAddress>
                <RequestVersion>2.0</RequestVersion>
                <DeviceType>WindowsPhone</DeviceType>
            </request>
        </Discover>
    </s:Body>
</s:Envelope>